// ***************** Конструкція async await ***************** \\


// ***************** Асинхрона функція завжди поверне проміс ***************** \\

// *****************Асинхронною функціює може бути будь який різновид функції ***************** \\

// ****** Arrow function ****** \\

// ****** Function expression ****** \\

// ****** Object method ****** \\

// ************ Обробка за допомогою then та catch ************ \\

// ************ Обробка за допомогою try та catch ************ \\

// // ************ Паралельні та послідовні запити ************ \\

// *********** Послідовні *********** \\

// *********** Паралельні *********** \\

// ********************* Практика ********************* \\
// Створи додаток для туристичного агенства
// Користувач має форму в яку може додавати довільну кількість полів
// В кожне поле він вводить назву країни
// Після сабміту форми форма відправляє запит на бекенд та отримує назви столиць цих країн
// На основі відповіді попереднього сервісу потрібно створити прогноз погоди по кожній столиці
// Використовуй паралельні запити
// Бекенд для пошуку країн https://restcountries.com/
// Бекенд для прогнозу погоди  https://www.weatherapi.com/docs/   КЛЮЧ ВАЛІДНИЙ 21 ДЕНЬ !!!!!
